Catalogs/DMS_СтатусыОтчетовПоРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_СтатусыОтчетовПоРекламнойКампании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВОтчете</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_СтатусыОтчетовПоРекламнойКампании/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтатусы() Экспорт 

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.Согласован.ПолучитьОбъект();
	Статус.Вес = 10;
	Статус.ПредставлениеВОтчете = "О";
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Зеленый,Новый СжатиеДанных(9));
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.Заявлен.ПолучитьОбъект();
	Статус.Наименование = "Подгружен";
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Голубой,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 20;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.НаСогласовании.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.СветлоЗеленый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 30;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.КомментарииОтMMR.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Желтый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 40;
	Статус.Записать();
	
	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.НеСогласован.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Красный,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 60;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.БезДействия.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Белый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 70;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.ВАрхиве.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Красный,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 80;
	Статус.Записать();

	Статус = Справочники.СтатусыОтчетовПоРекламнойКампании.БезОтчета.ПолучитьОбъект();
	Статус.ЦветФона = Новый ХранилищеЗначения(WebЦвета.Белый,Новый СжатиеДанных(9));
	Статус.ПредставлениеВОтчете = "О";
	Статус.Вес = 90;
	Статус.Записать();

КонецПроцедуры   
 
//#КонецОбласти

#КонецЕсли
